Repository: HeavenlyBlow/FreeKassa
Catalog: CashCode.Net/Properties/Resource.*.resx
Languages: ru

source: Error enabling bill reception. You should call the StartListening method.
ru: Ошибка метода включения приема купюр. Необходимо вызвать метод StartListening.

source: Received message checksum mismatch. The device may not be connected to the COM port. Check your connection settings.
ru: Несоответствие контрольной суммы полученного сообщения. Возможно, устройство не подключено к COM-порту. Проверьте настройки подключения.

# CashCodeErroList_UnknownError
source: Unknown error.
ru: Неизвестная ошибка.

# CashCodeErroList_ErrorOpeningComPort
source: Error opening COM-port.
ru: Ошибка открытия COM-порта.

# CashCodeErroList_ComPortNotOpen
source: COM-port is closed.
ru: COM-порт не открыт.

# CashCodeErroList_ErrorOffspringOfTheCommandToEnableTheBillValidator
source: Error sending command to enable the bill validator
ru: Ошибка отпраки команды включения купюроприемника.

source: Error sending command to enable the bill validator. No POWER UP message was received from the bill validator.
ru: Ошибка отпраки команды включения купюроприемника. От купюроприемника не получена команда POWER UP.

source: Error sending command to enable the bill validator. No ACK message was received from the bill validator.
ru: Ошибка отпраки команды включения купюроприемника. От купюроприемника не получена команда ACK.

source: Error sending command to enable the bill validator. No INITIALIZE message was received from the bill validator.
ru: Ошибка отпраки команды включения купюроприемника. От купюроприемника не получена команда INITIALIZE .

# CashCodeErroList_ErrorCheckingOfStatusOfTheBillValidatorStackerSDown
source: Error checking bill validator status. Stacker is down.
ru: Ошибка проверки статуса купюроприемника. Cтекер снят.

# CashCodeErroList_ErrorCheckingOfStatusOfTheBillValidatorStackerIsFull
source: Error checking of status of the bill validator. Stacker is full.
ru: Ошибка проверки статуса купюроприемника. Стекер переполнен.

source: Error checking of status of the bill validator. There's a bill stuck in the validator.
ru: Ошибка проверки статуса купюроприемника. В валидаторе застряла купюра.

source: Error checking of status of the bill validator. There's a bill stuck in the stacker.
ru: Ошибка проверки статуса купюроприемника. В стекере застряла купюра.

# CashCodeErroList_ErrorCheckingOfStatusOfTheBillValidatorFakeBill
source: Error checking of status of the bill validator. Fake bill.
ru: Ошибка проверки статуса купюроприемника. Фальшивая купюра.

source: Error checking of status of the bill validator. The previous bill has not yet hit the stack and is in the recognition mechanism.
ru: Ошибка проверки статуса купюроприемника. Предыдущая купюра еще не попала в стек и находится в механизме распознавания.

# CashCodeErroList_BillValidatorErrorStackerMechanismError
source: Bill validator error. Stacker mechanism error.
ru: Сбой при работе механизма стекера.

# CashCodeErroList_BillValidatorErrorStackerTransmissionSpeedError
source: Bill validator error. Stacker transmission speed error.
ru: Сбой в скорости передачи купюры в стекер.

# CashCodeErroList_BillValidatorErrorSendBillsToStackerError
source: Bill validator error. Stacking error
ru: Сбой передачи купюры в стекер.

# CashCodeErroList_BillValidatorErrorAlignmentBillsMechanismError
source: Bill validator error. Alignment bills mechanism error.
ru: Сбой механизма выравнивания купюр.

# CashCodeErroList_BillValidatorErrorStackerError
source: Bill validator error. Stacker error.
ru: Сбой в работе стекера.

# CashCodeErroList_BillValidatorErrorOpticalSensorsError
source: Bill validator error. Optical sensors error.
ru: Сбой в работе оптических сенсоров.

# CashCodeErroList_BillValidatorErrorInductanceChannelError
source: Bill validator error. Inductance channel error.
ru: Сбой работы канала индуктивности.

# CashCodeErroList_BillValidatorErrorStackerOccupancyCheckChannelError
source: Bill validator error. Stacker occupancy channel error.
ru: Сбой в работе канала проверки заполняемости стекера.

# CashCodeErroList_RejectingDueToInsertion
source: Rejecting due to Insertion
ru: Ошибка приема купюры. Купюра изъята.(Rejecting due to Insertion)

# CashCodeErroList_RejectingDueToMagnetic
source: Rejecting due to Magnetic
ru: Ошибка приема купюры. Ошибка магнитного сенсора.(Rejecting due to Magnetic)

# CashCodeErroList_RejectingDueToRemainedBillInHead
source: Rejecting due to Remained bill in head
ru: Ошибка приема купюры. Другая купюра находится в обработке.(Rejecting due to Remained bill in head)

# CashCodeErroList_RejectingDueToMultiplying
source: Rejecting due to Multiplying
ru: Ошибка приема купюры. Ошибка множителя.(Rejecting due to Multiplying)

# CashCodeErroList_RejectingDueToConveying
source: Rejecting due to Conveying
ru: Ошибка приема купюры. Ошибка передачи.(Rejecting due to Conveying)

# CashCodeErroList_RejectingDueToIdentification1
source: Rejecting due to Identification!
ru: Ошибка приема купюры. Купюра не распознана.(Rejecting due to Identification!)

# CashCodeErroList_RejectingDueToVerification
source: Rejecting due to Verification
ru: Ошибка приема купюры. Ошибка верификации.(Rejecting due to Verification)

# CashCodeErroList_RejectingDueToOptic
source: Rejecting due to Optic
ru: Ошибка приема купюры. Ошибка оптического сенсора.(Rejecting due to Optic)

# CashCodeErroList_RejectingDueToInhibit
source: Rejecting due to Inhibit
ru: Ошибка приема купюры. Прием запрещен.(Rejecting due to Inhibit)

# CashCodeErroList_RejectingDueToCapacity
source: Rejecting due to Capacity
ru: Ошибка приема купюры. Ошибка вместимости.(Rejecting due to Capacity)

# CashCodeErroList_RejectingDueToOperation
source: Rejecting due to Operation
ru: Ошибка приема купюры. Купюра не принята.(Rejecting due to Operation)

# CashCodeErroList_RejectingDueToLength
source: Rejecting due to Length
ru: Ошибка приема купюры. Ошибка размера купюры.(Rejecting due to Length)

# _Listener_Elapsed_Code0NotFoundInBillTable
source: Code {0} not found in bill table
ru: Код {0} не найден в таблице купюр

# AcceptBill_ErrorAcceptingBill
source: Error accepting bill
ru: Ошибка приема купюры

# RejectBill_ErrorReturnBill
source: Error return bill
ru: Ошибка отмены приема купюр
